Autodesk.Revit.DB.LinkConversionData.GetOptions
Extra information used during the creation of the Revit document.
Returns:
The extra information used during the creation of the Revit document.
Since:
2015

Autodesk.Revit.DB.LinkConversionData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.LinkConversionData.Path
The path to the source data used to generate the model.
Since:
2015

Autodesk.Revit.DB.LinkConversionData.ServerId
The service responsible for converting the data into a Revit file.
Since:
2015

Autodesk.Revit.DB.LinkConversionData
This class contains the information necessary to re-create a Revit document
from an external source.
Since:
2015